{
    "description": "A list of rpg style encounters.",
    "items": [
        "A natural disaster.",
        "A plague sweeps through.",
        "A member of royalty is kidnapped.",
        "A goblin enters the village.",
        "A zombie terrifies travellers.",
        "A small child is lost.",
        "A travelling adventurer wants to swap stories.",
        "A travelling peddler seeks to sell their wares.",
        "A witch arrives seeking someone to acquire ingredients.",
        "A wild boar breaks into a nearby farmland.",
        "A greedy thief is on the loose.",
        "Two women escape a prison and seek asylum.",
        "A magical sword stuck in a tree is found.",
        "A giant threatens to destroy the village.",
        "A nest of giant spiders is unearthed while digging a house foundation.",
        "A vampire is lonely and seeks someone for a companion.",
        "A mysterious plague leaves its victims turned to stone.",
        "A young girl wants to join the party.",
        "A cooking contest is tomorrow - the main ingredient is dragon.",
        "A mysterious ship with no crew arrives at a nearby port.",
        "A dragon's nest has been discovered. The eggs are about to hatch.",
        "You are mistaken for a bounty hunter's target.",
        "A guild of sorcerers want you to join their group.",
        "Everyone in a small village has disappeared except for a single cat.",
        "A ghost starts haunting you until you help them resolve their unfinished task.",
        "A young girl has lost her sister to a group of slavers",
        "A key is left at your doorstep. It talks.",
        "A young woman seeks revenge after being betrayed by her boyfriend.",
        "An old baker needs someone to help him deliver his goods for the day.",
        "You are suddenly surrounded by a party of thieves. You recognise one of them.",
        "A dog comes up to you and asks for help finding its owner.",
        "A warrior appears on the path before you with no clothes and no memory.",
        "A knight is looking for a last adventure before retiring.",
        "You accidentally open a box containing an evil spirit.",
        "You find a magic ring that makes you invisible.",
        "A crystal box has been unearthed with a sleeping princess in it.",
        "A locked box of treasure has been found.",
        "A travelling teacher offers to give you lessons on a topic of your choice.",
        "A avalanche blocks the only road out of town.",
        "You have been kidnapped by pirates.",
        "You wake up in jail with no idea how you got there.",
        "The local lord's wife has been kidnapped.",
        "A local wizard posts a help wanted poster.",
        "A party of orcs emerge from the forest looking angry.",
        "You encounter an abandoned house. No one has been there for years it seems.",
        "A trading caravan has been stopped on the road due to one of the carriages breaking down.",
        "A nearby forest seems to be filled with ghosts at night",
        "A desperate boy accosts you with a knife",
        "A huge nests of insects is discovered nearby",
        "A old man gives you a magical paintbrush set",
        "You stumble across an esoteric ritual taking place in a forest",
        "A vistor from a distant land seeks someone to escort them around and see the local sights",
        "A villager comes to ask you to help with a construction project",
        "A young girl comes up to you and says she is your daughter.",
        "You find a magic mirror. It says it has one last wish left in it. What will you asked to see?",
        "A huge wyvern blocks your path. It says it must give someone a ride to their destiny to lift a curse on it.",
        "You find a diary from a famous adventurer who passed away years ago.",
        "A ghostly woman beckons you to a nearby haunted house."
    ]
}